pmo-dataset/variations/graphviz_basic/45.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Open E-Shop Homepage" -> "customer logs into E-Shop";
  "customer logs into E-Shop" -> "customer credentials being checked by system";
  "customer credentials being checked by system" -> "succesful login?";
  "customer selects a product" -> "customer adds product to shopping cart";
  "customer adds product to shopping cart" -> "customer saves product";
  "customer saves product" -> "customer checks if product was already selected";
  "customer checks if product was already selected" -> "has customer selected all desired products?";
  "ParallelGateway_1" -> "Payment is prepared by system";
  "ParallelGateway_1" -> "Shipment is prepared by system";
  "ParallelGateway_2" -> "order is being finished by system";
  "customer enters payment data" -> "ParallelGateway_3";
  "Payment is prepared by system" -> "ParallelGateway_4";
  "Shipment is prepared by system" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "customer enters payment data";
  "ParallelGateway_3" -> "customer enters shipping address";
  "customer enters shipping address" -> "if shipping adress == billing adress?";
  "customer enters an independent billing adress" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "ParallelGateway_2";
  "if shipping adress == billing adress?" -> "ExclusiveGateway_1" [label="Yes"];
  "if shipping adress == billing adress?" -> "customer enters an independent billing adress" [label="No"];
  "has customer selected all desired products?" -> "ParallelGateway_1" [label="Yes"];
  "order is being finished by system" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "Close E-Shop Homepage";
  "ExclusiveGateway_3" -> "customer selects a product";
  "succesful login?" -> "ExclusiveGateway_3" [label="Yes"];
  "ParallelGateway_3" -> "customer waits until bank confirms payment";
  "customer waits until bank confirms payment" -> "ParallelGateway_2";
  "has customer selected all desired products?" -> "ExclusiveGateway_3" [label="No"];
  "succesful login?" -> "ExclusiveGateway_2" [label="No"];

  "Open E-Shop Homepage" [shape=circle, label="Open E-Shop Homepage"];
  "Close E-Shop Homepage" [shape=circle, label="Close E-Shop Homepage"];
  "succesful login?" [shape=diamond];
  "has customer selected all desired products?" [shape=diamond];
  "if shipping adress == billing adress?" [shape=diamond];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
}
