pmo-dataset/variations/mermaid_basic/45.mmd
graph LR
	StartEvent_1(("Open E-Shop Homepage")) --> Task_6["customer logs into E-Shop"]
	Task_6 --> Task_2["customer credentials being checked by system"]
	Task_2 --> ExclusiveGateway_1{"succesful login?"}
	Task_7["customer selects a product"] --> Task_8["customer adds product to shopping cart"]
	Task_8 --> Task_9["customer saves product"]
	Task_9 --> Task_10["customer checks if product was already selected"]
	Task_10 --> ExclusiveGateway_2{"has customer selected all desired products?"}
	ParallelGateway_1{"+"} --> Task_3["Payment is prepared by system"]
	ParallelGateway_1 --> Task_4["Shipment is prepared by system"]
	ParallelGateway_2{"+"} --> Task_5["order is being finished by system"]
	Task_11["customer enters payment data"] --> ParallelGateway_3{"+"}
	Task_3 --> ParallelGateway_4{"+"}
	Task_4 --> ParallelGateway_4
	ParallelGateway_4 --> Task_11
	ParallelGateway_3 --> Task_12["customer enters shipping address"]
	Task_12 --> ExclusiveGateway_3{"if shipping adress == billing adress?"}
	Task_13["customer enters an independent billing adress"] --> ExclusiveGateway_4{"X"}
	ExclusiveGateway_4 --> ParallelGateway_2
	ExclusiveGateway_3 -->|"Yes"| ExclusiveGateway_4
	ExclusiveGateway_3 -->|"No"| Task_13
	ExclusiveGateway_2 -->|"Yes"| ParallelGateway_1
	Task_5 --> ExclusiveGateway_5{"X"}
	ExclusiveGateway_5 --> EndEvent_1(("Close E-Shop Homepage"))
	ExclusiveGateway_6{"X"} --> Task_7
	ExclusiveGateway_1 -->|"Yes"| ExclusiveGateway_6
	ParallelGateway_3 --> Task_1["customer waits until bank confirms payment"]
	Task_1 --> ParallelGateway_2
	ExclusiveGateway_2 -->|"No"| ExclusiveGateway_6
	ExclusiveGateway_1 -->|"No"| ExclusiveGateway_5
